Autodesk.Revit.DB.FamilyUtils.GetProfileSymbols(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ProfileFamilyUsage,System.Boolean)
Gets the profile Family Symbols of the document.
document:
The document.
profileFamilyUsage:
The profile family usage.
oneCurveLoopOnly:
Whether or not to return only profiles with one curve loop.
Returns:
The set of profile Family Symbol element ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FamilyUtils.FamilyCanConvertToFaceHostBased(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates whether the family can be converted to face host based.
document:
The document.
familyId:
The element id of the family.
Returns:
True if the family can be converted to face-based.
Otherwise false, which will be returned if there any family instances exist in the project, the family is already face-based, or the family does not have a host.
Also, false is returned if the family does not belong to one of the following categories:
OST_CommunicationDevicesOST_DataDevicesOST_DuctTerminalOST_ElectricalEquipmentOST_ElectricalFixturesOST_FireAlarmDevicesOST_LightingDevicesOST_LightingFixturesOST_MechanicalEquipmentOST_NurseCallDevicesOST_PlumbingFixturesOST_SecurityDevicesOST_SprinklersOST_TelephoneDevices
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.FamilyUtils.ConvertFamilyToFaceHostBased(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Converts a family to be face host based.
Remarks:
Converts a family hosted by some element other than a face to be hosted by a face. This is done by replacing the existing host (wall, roof, ceiling, floor) with a face.
Conversion can succeed only if FamilyUtils.FamilyCanConvertToFaceHostBased() returns true.
document:
The document containing the family to be converted.
familyId:
The family id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input familyId cannot be converted to face host based.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to convert the family to face host based.
-or-
The family is already unhosted.

Autodesk.Revit.DB.FamilyUtils
Contains utilities related to family operations.